app/Controllers/Inicio.php

SELECT *
FROM `tarefas`
---
    public function index()
    {
        $tarefaModel = new TarefaModel();

        echo View('template/header');
        echo View('inicio/index', [
            'tarefas' => $tarefaModel->findAll()
        ]);

INSERT INTO `tarefas` (`descricao`, `nivel`) VALUES ('ir na casa do primo cortar o cabelo', 'alto')
---
    public function store()
    {
        $post = $this->request->getPost();

        $tarefaModel = new TarefaModel();
        if ($tarefaModel->save($post)) {